; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	thermograph3 - mode
	image0 - mode
	thermograph4 - mode
	thermograph1 - mode
	thermograph2 - mode
	groundstation1 - direction
	star0 - direction
	groundstation2 - direction
	star4 - direction
	star3 - direction
	star5 - direction
	phenomenon6 - direction
	phenomenon7 - direction
	star8 - direction
	phenomenon9 - direction
	planet10 - direction
	planet11 - direction
	planet12 - direction
	planet13 - direction
	phenomenon14 - direction
	star15 - direction
	phenomenon16 - direction
	planet17 - direction
	planet18 - direction
	phenomenon19 - direction
	phenomenon20 - direction
	star21 - direction
	phenomenon22 - direction
	star23 - direction
	phenomenon24 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 groundstation2)
	(supports instrument1 thermograph4)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 groundstation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 groundstation2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 star3)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 groundstation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 star21)
	(supports instrument4 image0)
	(calibration_target instrument4 groundstation1)
	(supports instrument5 thermograph4)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet17)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 star3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 planet10)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 star3)
	(supports instrument8 image0)
	(calibration_target instrument8 groundstation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 star5)
	(supports instrument9 thermograph1)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph4)
	(calibration_target instrument9 groundstation2)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 star4)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 star3)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 star23)
)
(:goal (and
	(pointing satellite1 planet18)
	(have_image star5 thermograph4)
	(have_image phenomenon6 thermograph1)
	(have_image phenomenon7 thermograph1)
	(have_image star8 thermograph2)
	(have_image phenomenon9 thermograph3)
	(have_image planet10 thermograph1)
	(have_image planet11 image0)
	(have_image planet12 thermograph1)
	(have_image phenomenon14 thermograph2)
	(have_image star15 thermograph1)
	(have_image phenomenon16 thermograph1)
	(have_image planet17 thermograph3)
	(have_image planet18 image0)
	(have_image phenomenon19 image0)
	(have_image star21 image0)
	(have_image phenomenon22 thermograph4)
	(have_image star23 thermograph2)
	(have_image phenomenon24 thermograph2)
))

)

; plan
1. (switch_on instrument10 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument10)
   goals met: 0 of 19
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 19
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 19
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 19
5. (turn_to satellite5 phenomenon16 star23)
   deleted: (pointing satellite5 star23)
   added: (pointing satellite5 phenomenon16)
   goals met: 0 of 19
6. (turn_to satellite2 groundstation1 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 19
7. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 19
8. (turn_to satellite2 phenomenon19 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon19)
   goals met: 0 of 19
9. (take_image satellite2 phenomenon19 instrument4 image0)
   added: (have_image phenomenon19 image0)
   goals met: 1 of 19
10. (turn_to satellite2 planet11 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 planet11)
   goals met: 1 of 19
11. (take_image satellite2 planet11 instrument4 image0)
   added: (have_image planet11 image0)
   goals met: 2 of 19
12. (turn_to satellite2 planet18 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet18)
   goals met: 2 of 19
13. (take_image satellite2 planet18 instrument4 image0)
   added: (have_image planet18 image0)
   goals met: 3 of 19
14. (turn_to satellite2 star21 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 star21)
   goals met: 3 of 19
15. (take_image satellite2 star21 instrument4 image0)
   added: (have_image star21 image0)
   goals met: 4 of 19
16. (turn_to satellite1 groundstation1 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 groundstation1)
   goals met: 4 of 19
17. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 4 of 19
18. (turn_to satellite1 phenomenon14 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon14)
   goals met: 4 of 19
19. (take_image satellite1 phenomenon14 instrument3 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 5 of 19
20. (turn_to satellite1 phenomenon24 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon24)
   goals met: 5 of 19
21. (take_image satellite1 phenomenon24 instrument3 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 6 of 19
22. (turn_to satellite1 planet18 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 planet18)
   goals met: 7 of 19
23. (turn_to satellite0 groundstation1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation1)
   goals met: 7 of 19
24. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 7 of 19
25. (turn_to satellite0 phenomenon22 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon22)
   goals met: 7 of 19
26. (take_image satellite0 phenomenon22 instrument1 thermograph4)
   added: (have_image phenomenon22 thermograph4)
   goals met: 8 of 19
27. (turn_to satellite0 phenomenon9 phenomenon22)
   deleted: (pointing satellite0 phenomenon22)
   added: (pointing satellite0 phenomenon9)
   goals met: 8 of 19
28. (take_image satellite0 phenomenon9 instrument1 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 9 of 19
29. (turn_to satellite0 planet17 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet17)
   goals met: 9 of 19
30. (take_image satellite0 planet17 instrument1 thermograph3)
   added: (have_image planet17 thermograph3)
   goals met: 10 of 19
31. (turn_to satellite0 star5 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star5)
   goals met: 10 of 19
32. (take_image satellite0 star5 instrument1 thermograph4)
   added: (have_image star5 thermograph4)
   goals met: 11 of 19
33. (turn_to satellite1 star8 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star8)
   goals met: 10 of 19
34. (take_image satellite1 star8 instrument3 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 11 of 19
35. (turn_to satellite1 planet18 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet18)
   goals met: 12 of 19
36. (turn_to satellite5 star4 phenomenon16)
   deleted: (pointing satellite5 phenomenon16)
   added: (pointing satellite5 star4)
   goals met: 12 of 19
37. (calibrate satellite5 instrument10 star4)
   added: (calibrated instrument10)
   goals met: 12 of 19
38. (turn_to satellite5 phenomenon16 star4)
   deleted: (pointing satellite5 star4)
   added: (pointing satellite5 phenomenon16)
   goals met: 12 of 19
39. (take_image satellite5 phenomenon16 instrument10 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 13 of 19
40. (turn_to satellite5 phenomenon6 phenomenon16)
   deleted: (pointing satellite5 phenomenon16)
   added: (pointing satellite5 phenomenon6)
   goals met: 13 of 19
41. (take_image satellite5 phenomenon6 instrument10 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 14 of 19
42. (turn_to satellite5 phenomenon7 phenomenon6)
   deleted: (pointing satellite5 phenomenon6)
   added: (pointing satellite5 phenomenon7)
   goals met: 14 of 19
43. (take_image satellite5 phenomenon7 instrument10 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 15 of 19
44. (turn_to satellite5 planet10 phenomenon7)
   deleted: (pointing satellite5 phenomenon7)
   added: (pointing satellite5 planet10)
   goals met: 15 of 19
45. (take_image satellite5 planet10 instrument10 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 16 of 19
46. (turn_to satellite5 planet12 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 planet12)
   goals met: 16 of 19
47. (take_image satellite5 planet12 instrument10 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 17 of 19
48. (turn_to satellite5 star15 planet12)
   deleted: (pointing satellite5 planet12)
   added: (pointing satellite5 star15)
   goals met: 17 of 19
49. (take_image satellite5 star15 instrument10 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 18 of 19
50. (turn_to satellite1 star23 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star23)
   goals met: 17 of 19
51. (take_image satellite1 star23 instrument3 thermograph2)
   added: (have_image star23 thermograph2)
   goals met: 18 of 19
52. (turn_to satellite1 planet18 star23)
   deleted: (pointing satellite1 star23)
   added: (pointing satellite1 planet18)
   goals met: 19 of 19
